In [19]:
import pandas as pd
df = pd.read_csv("employee_data.csv")
df

,Employee_ID,Name,Department,Salary,Joining_Date,Age,City,Gender
0,E101,John Smith,IT,75000,23-06-2015,29,New York,Male
1,E102,Jane Doe,HR,52000,14-08-2017,34,San Francisco,Female
2,E103,Mike Brown,IT,67000,21-09-2018,41,Chicago,Male
3,E104,Emily Davis,Marketing,59000,11-11-2016,38,Boston,Female
4,E105,David Wilson,Finance,88000,19-04-2014,45,Dallas,Male
5,E106,Sarah Taylor,Marketing,64000,01-01-2019,31,Los Angeles,Female
6,E107,Chris Evans,HR,55000,07-07-2020,25,Austin,Male
7,E108,Anna White,IT,71000,15-03-2021,27,Seattle,Female

In [20]:
df.head()

,Employee_ID,Name,Department,Salary,Joining_Date,Age,City,Gender
0,E101,John Smith,IT,75000,23-06-2015,29,New York,Male
1,E102,Jane Doe,HR,52000,14-08-2017,34,San Francisco,Female
2,E103,Mike Brown,IT,67000,21-09-2018,41,Chicago,Male
3,E104,Emily Davis,Marketing,59000,11-11-2016,38,Boston,Female
4,E105,David Wilson,Finance,88000,19-04-2014,45,Dallas,Male

In [21]:
df.tail()

,Employee_ID,Name,Department,Salary,Joining_Date,Age,City,Gender
3,E104,Emily Davis,Marketing,59000,11-11-2016,38,Boston,Female
4,E105,David Wilson,Finance,88000,19-04-2014,45,Dallas,Male
5,E106,Sarah Taylor,Marketing,64000,01-01-2019,31,Los Angeles,Female
6,E107,Chris Evans,HR,55000,07-07-2020,25,Austin,Male
7,E108,Anna White,IT,71000,15-03-2021,27,Seattle,Female

In [22]:
df.describe()

             Salary        Age
count      8.000000   8.000000
mean   66375.000000  33.750000
std    11710.038429   7.066015
min    52000.000000  25.000000
25%    58000.000000  28.500000
50%    65500.000000  32.500000
75%    72000.000000  38.750000
max    88000.000000  45.000000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Employee_ID   8 non-null      object
 1   Name          8 non-null      object
 2   Department    8 non-null      object
 3   Salary        8 non-null      int64
 4   Joining_Date  8 non-null      object
 5   Age           8 non-null      int64
 6   City          8 non-null      object
 7   Gender        8 non-null      object
dtypes: int64(2), object(6)
memory usage: 392.0+ bytes

In [24]:
df.head(3)

,Employee_ID,Name,Department,Salary,Joining_Date,Age,City,Gender
0,E101,John Smith,IT,75000,23-06-2015,29,New York,Male
1,E102,Jane Doe,HR,52000,14-08-2017,34,San Francisco,Female
2,E103,Mike Brown,IT,67000,21-09-2018,41,Chicago,Male

In [25]:
df.tail(3)

,Employee_ID,Name,Department,Salary,Joining_Date,Age,City,Gender
5,E106,Sarah Taylor,Marketing,64000,01-01-2019,31,Los Angeles,Female
6,E107,Chris Evans,HR,55000,07-07-2020,25,Austin,Male
7,E108,Anna White,IT,71000,15-03-2021,27,Seattle,Female

In [26]:
data=df.drop(columns=['Age'])
data

,Employee_ID,Name,Department,Salary,Joining_Date,City,Gender
0,E101,John Smith,IT,75000,23-06-2015,New York,Male
1,E102,Jane Doe,HR,52000,14-08-2017,San Francisco,Female
2,E103,Mike Brown,IT,67000,21-09-2018,Chicago,Male
3,E104,Emily Davis,Marketing,59000,11-11-2016,Boston,Female
4,E105,David Wilson,Finance,88000,19-04-2014,Dallas,Male
5,E106,Sarah Taylor,Marketing,64000,01-01-2019,Los Angeles,Female
6,E107,Chris Evans,HR,55000,07-07-2020,Austin,Male
7,E108,Anna White,IT,71000,15-03-2021,Seattle,Female

In [27]:
data=df.rename(columns={'City':'Location'})
data

,Employee_ID,Name,Department,Salary,Joining_Date,Age,Location,Gender
0,E101,John Smith,IT,75000,23-06-2015,29,New York,Male
1,E102,Jane Doe,HR,52000,14-08-2017,34,San Francisco,Female
2,E103,Mike Brown,IT,67000,21-09-2018,41,Chicago,Male
3,E104,Emily Davis,Marketing,59000,11-11-2016,38,Boston,Female
4,E105,David Wilson,Finance,88000,19-04-2014,45,Dallas,Male
5,E106,Sarah Taylor,Marketing,64000,01-01-2019,31,Los Angeles,Female
6,E107,Chris Evans,HR,55000,07-07-2020,25,Austin,Male
7,E108,Anna White,IT,71000,15-03-2021,27,Seattle,Female

In [40]:
average_salary = df.groupby('Department')['Salary'].mean().reset_index()
average_salary

  Department   Salary
0    Finance  88000.0
1         HR  53500.0
2         IT  71000.0
3  Marketing  61500.0

In [38]:
employee_count = df.groupby('Department').size().reset_index(name='Employee Count')
employee_count

  Department  Employee Count
0    Finance               1
1         HR               2
2         IT               3
3  Marketing               2

In [41]:
total_salary_by_gender = df.groupby('Gender')['Salary'].sum().reset_index()
total_salary_by_gender

   Gender  Salary
0  Female  246000
1    Male  285000